rental-cars-qsd2019/app/controllers/car_categories_controller.rb

INSERT INTO "car_categories" ("name", "daily_rate", "car_insurance", "third_party_insurance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "A"], ["daily_rate", 84.0], ["car_insurance", 34.0], ["third_party_insurance", 10.0], ["created_at", "2020-01-09 01:09:16.189070"], ["updated_at", "2020-01-09 01:09:16.189070"]]
---
  def create
    @car_category = CarCategory.new(params_car_category)
    if @car_category.save

SELECT "car_categories".* FROM "car_categories"
---
  def index
    @car_categories = CarCategory.all

SELECT  "car_categories".* FROM "car_categories" WHERE "car_categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @car_category = CarCategory.find(params[:id])

SELECT  "car_categories".* FROM "car_categories" WHERE "car_categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @car_category = CarCategory.find(params[:id])

SELECT  "car_categories".* FROM "car_categories" WHERE "car_categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "car_categories" SET "daily_rate" = ?, "updated_at" = ? WHERE "car_categories"."id" = ?  [["daily_rate", 85.0], ["updated_at", "2020-01-09 01:56:40.665898"], ["id", 6]]
---
  def update
    @car_category = CarCategory.find(params[:id])
    if @car_category.update(params_car_category)

SELECT  "car_categories".* FROM "car_categories" WHERE "car_categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "car_categories" WHERE "car_categories"."id" = ?  [["id", 6]]
---
  def destroy
    @car_category = CarCategory.find(params[:id])
    @car_category.destroy