rental-cars-qsd2019/app/controllers/car_models_controller.rb

INSERT INTO "car_models" ("name", "year", "motorization", "fuel_type", "created_at", "updated_at", "car_category_id", "manufacturer_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @car_model = CarModel.new(params_car_model)

    return redirect_to @car_model, notice: 'Modelo de carro criado com sucesso!' if @car_model.save

SELECT "car_models".* FROM "car_models"
---
  def index
    @car_models = CarModel.all

SELECT  "car_models".* FROM "car_models" WHERE "car_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @car_model = CarModel.find(params[:id])

SELECT  "car_models".* FROM "car_models" WHERE "car_models"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @car_model = CarModel.find(params[:id])

SELECT  "car_models".* FROM "car_models" WHERE "car_models"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "car_models" SET "year" = ?, "car_category_id" = ?, "updated_at" = ? WHERE "car_models"."id" = ?  [["year", "2015"], ["car_category_id", 8], ["updated_at", "2020-01-10 17:38:17.665785"], ["id", 6]]
---
  def update
    @car_model = CarModel.find(params[:id])

    return redirect_to car_model_path(@car_model), notice: 'Modelo de carro editado com sucesso!' if @car_model.update(params_car_model)

DELETE FROM "car_models" WHERE "car_models"."id" = ?  [["id", 10]]
---
  def destroy
    CarModel.destroy(params[:id])