rental-cars-qsd2019/app/controllers/clients_controller.rb

  def create
    @client = Client.new(params_client)

    return redirect_to clients_path,
                       notice: t('.success') if @client.save
---
INSERT INTO "clients" ("name", "document", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Luan"], ["document", "39263107823"], ["email", "luan.mesquita@hotmail.com"], ["created_at", "2020-01-13 04:54:38.701462"], ["updated_at", "2020-01-13 04:54:38.701462"]]