rental-cars-qsd2019/app/controllers/manufacturers_controller.rb

  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save
---
INSERT INTO "manufacturers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fiat"], ["created_at", "2019-12-30 04:48:55.457485"], ["updated_at", "2019-12-30 04:48:55.457485"]]

  def index
    @manufacturers = Manufacturer.all
---
SELECT "manufacturers".* FROM "manufacturers"

  def show
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def edit
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 59], ["LIMIT", 1]]

  def update
    @manufacturer = Manufacturer.find(params[:id])
    if @manufacturer.update(manufacturer_params)
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
UPDATE "manufacturers" SET "name" = ?, "updated_at" = ? WHERE "manufacturers"."id" = ?  [["name", "Ford"], ["updated_at", "2019-12-23 04:20:09.377037"], ["id", 58]]

  def destroy
    Manufacturer.destroy(params[:id])
---
DELETE FROM "manufacturers" WHERE "manufacturers"."id" = ?  [["id", 61]]