rental-cars-qsd2019/app/controllers/manufacturers_controller.rb

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @manufacturer = Manufacturer.find(params[:id])