rental-cars-qsd2019/app/controllers/subsidiaries_controller.rb

INSERT INTO "subsidiaries" ("name", "cnpj", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Giovane"], ["cnpj", "01"], ["address", "Rua tamoios"], ["created_at", "2019-12-30 22:02:07.448554"], ["updated_at", "2019-12-30 22:02:07.448554"]]
---
  def create
    @subsidiary = Subsidiary.new(subsidiary_params)
    if @subsidiary.save

SELECT "subsidiaries".* FROM "subsidiaries"
---
  def index
    @subsidiaries = Subsidiary.all

SELECT  "subsidiaries".* FROM "subsidiaries" WHERE "subsidiaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @subsidiary = Subsidiary.find(params[:id])

SELECT  "subsidiaries".* FROM "subsidiaries" WHERE "subsidiaries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @subsidiary = Subsidiary.find(params[:id])

SELECT  "subsidiaries".* FROM "subsidiaries" WHERE "subsidiaries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "subsidiaries" SET "name" = ?, "address" = ?, "cnpj" = ?, "updated_at" = ? WHERE "subsidiaries"."id" = ?  [["name", "Carrefour Giovanni"], ["address", "Av Alberto Augusto Alves, 50, Vila Andrade"], ["cnpj", "16468498000151"], ["updated_at", "2019-12-31 01:56:19.506381"], ["id", 3]]
---
  def update
    @subsidiary = Subsidiary.find(params[:id])
    if @subsidiary.update(subsidiary_params)

SELECT  "subsidiaries".* FROM "subsidiaries" WHERE "subsidiaries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "subsidiaries" WHERE "subsidiaries"."id" = ?  [["id", 3]]
---
  def destroy
    @subsidiary = Subsidiary.find(params[:id])
    @subsidiary.destroy